pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_semantics.h
//---------------------------------------------------------------------------*
//                                                                           *
//                         File 'pic18_semantics.h'                          *
//                        Generated by version 2.5.0                         *
//                     october 6th, 2013, at 18h34'51"                       *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_semantics_ENTITIES_DEFINED
#define pic18_semantics_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_build_binary_code.h"
#include "pic18_intermediate_classes_instruction_length.h"
#include "pic18_intermediate_classes.h"
#include "pic18_mnemonics.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"
#include "pic18_build_assembly_code.h"
#include "piccolo_embedded_devices.h"
#include "pic18_checkingAndBuildIPIC.h"
#include "pic18_intermediate_classes_set_current_address.h"
#include "pic18_convert_relatives.h"
#include "pic18_optimizations.h"
#include "pic18_intermediate_next_intruction_is_reachable.h"
#include "piccolo_config.h"
#include "ram_sections.h"
#include "pic18_metrics_analysis.h"
#include "ipic18_build_block_representation.h"
#include "ipic18_optimize_block.h"
#include "ipic18_display_block_list.h"
#include "ipic18_block_representation.h"
#include "ipic18_regular_instructions.h"
#include "ipic18_terminators.h"
#include "ipic18_block_ordering.h"
#include "ipic18_cluster_ordering.h"
#include "ipic18_relatives_resolution.h"
#include "ipic18_code_generation.h"
#include "pic18_used_routines.h"

//---------------------------------------------------------------------------*

class GALGAS_declaredRoutineMap ;
class GALGAS_declaredRoutineMap_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//              Routine 'pic18_build_listing_of_generated_code'              *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_pic_31__38__5F_build_5F_listing_5F_of_5F_generated_5F_code (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument0,
                                                                         GALGAS_string & ioArgument1,
                                                                         C_Compiler * inCompiler
                                                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                          @declaredRoutineMap map                          *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_declaredRoutineMap ;

//---------------------------------------------------------------------------*

extern const char * kSearchErrorMessage_declaredRoutineMap_searchKey ;

//---------------------------------------------------------------------------*

class GALGAS_declaredRoutineMap : public AC_GALGAS_map {
//--------------------------------- Default constructor
  public : GALGAS_declaredRoutineMap (void) ;

//--------------------------------- Handle copy
  public : GALGAS_declaredRoutineMap (const GALGAS_declaredRoutineMap & inSource) ;
  public : GALGAS_declaredRoutineMap & operator = (const GALGAS_declaredRoutineMap & inSource) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_declaredRoutineMap extractObject (const GALGAS_object & inObject,
                                                           C_Compiler * inCompiler
                                                           COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_declaredRoutineMap constructor_emptyMap (LOCATION_ARGS) ;

  public : static GALGAS_declaredRoutineMap constructor_mapWithMapToOverride (const GALGAS_declaredRoutineMap & inOperand0
                                                                              COMMA_LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_insertKey (GALGAS_lstring constinArgument0,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_searchKey (GALGAS_lstring constinArgument0,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_declaredRoutineMap reader_overriddenMap (C_Compiler * inCompiler
                                                                            COMMA_LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- 'with' accessors
  public : VIRTUAL_IN_DEBUG cMapElement_declaredRoutineMap * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                       const GALGAS_string & inKey
                                                                                                       COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG cMapElement_declaredRoutineMap * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                          const GALGAS_lstring & inKey
                                                                                                          COMMA_LOCATION_ARGS) ;

//--------------------------------- Friend

  friend class cEnumerator_declaredRoutineMap ;
 
} ; // End of GALGAS_declaredRoutineMap class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_declaredRoutineMap : public cGenericAbstractEnumerator {
  public : cEnumerator_declaredRoutineMap (const GALGAS_declaredRoutineMap & inEnumeratedObject,
                                           const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_lstring current_lkey (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_declaredRoutineMap_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_declaredRoutineMap ;

//--------------------------------- 'with' accessors
cCollectionElement * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                               GALGAS_declaredRoutineMap & ioMap,
                                                               GALGAS_string & inKey
                                                               COMMA_LOCATION_ARGS) ;

cCollectionElement * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                  GALGAS_declaredRoutineMap & ioMap,
                                                                  GALGAS_lstring & inKey
                                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                          Routine 'pic18_analyze'                          *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_pic_31__38__5F_analyze (const GALGAS_piccoloModel constinArgument0,
                                     const GALGAS_string constinArgument1,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   @declaredRoutineMap_2E_element struct                   *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_declaredRoutineMap_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_lstring mAttribute_lkey ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_declaredRoutineMap_2E_element constructor_default (LOCATION_ARGS) ;

//--------------------------------- Default constructor
  public : GALGAS_declaredRoutineMap_2E_element (void) ;

//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_declaredRoutineMap_2E_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_declaredRoutineMap_2E_element (const GALGAS_lstring & in_lkey) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_declaredRoutineMap_2E_element extractObject (const GALGAS_object & inObject,
                                                                      C_Compiler * inCompiler
                                                                      COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_declaredRoutineMap_2E_element constructor_new (const GALGAS_lstring & inOperand0
                                                                        COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_declaredRoutineMap_2E_element & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_lkey (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_declaredRoutineMap_2E_element class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_declaredRoutineMap_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//              Class for element of '@declaredRoutineMap' map               *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_declaredRoutineMap : public cMapElement {
//--- Map attributes

//--- Constructor
  public : cMapElement_declaredRoutineMap (const GALGAS_lstring & inKey
                                           COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cMapElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
